src/Documents/ИС_ЯМ_Заказ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ИС_ЯМ_Заказ</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>itemsTotal</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>total</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>serviceName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>price</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>type</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_ЯМ_Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>shipmentDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>address</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>recipient</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>phone</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>cancelRequested</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоDBS</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_МП_МодельРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>items</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НоменклатураЯМ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИС_ЯМ_Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШтрихкодЯМ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИС_ЯМ_Штрихкоды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>count</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>price</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>shipmentDate</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>id</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/ИС_ЯМ_СоответствиеХарактеристик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_ЯМ_СоответствиеХарактеристик</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатураЯМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_ЯМ_Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИС_ЯМ_СтатусыСборочныхЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_ЯМ_СтатусыСборочныхЗаданий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>status</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_ЯМ_СтатусыЗаказов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>substatus</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_ЯМ_ДетальныеСтатусы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИС_ЯМ_Заказ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ИС_ЯМ_СтатусыЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ИС_ЯМ_СтатусыЗаказов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>CANCELLED</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DELIVERED</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DELIVERY</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PICKUP</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PROCESSING</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>UNPAID</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PLACING</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>RESERVED</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PENDING</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>REJECTED</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PARTIALLY_RETURNED</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>RETURNED</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CANCELLED_WITHOUT_REFUND</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>UNKNOWN</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ИС_ЯМ_ДетальныеСтатусы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ИС_ЯМ_ДетальныеСтатусы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>STARTED</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>READY_TO_SHIP</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PROCESSING_EXPIRED</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>REPLACING_ORDER</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>RESERVATION_EXPIRED</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SHOP_FAILED</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>USER_CHANGED_MIND</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>USER_NOT_PAID</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>USER_REFUSED_DELIVERY</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>USER_REFUSED_PRODUCT</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>USER_REFUSED_QUALITY</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>USER_UNREACHABLE</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SHIPPED</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ИС_ЯМ_УпаковкаТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ИС_ЯМ_УпаковкаТоваров</Name>
			<Comment>ИнфоСофт Власова И.С. 22.03.24 УА #71520</Comment>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПечатиЭтикеток</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_НастройкиПечати</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ИС_ЯМ_Заказ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЗаказ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтикеткаРаспечатана</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ИС_ЯМ_Заказ/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИС_WB_Сервер.ПриСозданииНаСервере(ЭтотОбъект);	
	//+ ИнфоСофт Стояк Ю.К. 29.12.2023 УА #66678	
	Список.ТекстЗапроса = ИС_ЯМ_Сервер.ПолучитьТекстЗапросаСборочныхЗаданий(); 
	Список.ОсновнаяТаблица = "Документ.ИС_ЯМ_Заказ";
	//- ИнфоСофт Стояк Ю.К. 29.12.2023 УА #66678
	//+ ИнфоСофт Мурсалимов Д.Р. 05.04.24 УА #73236
	СортировкаПечати = "Номер";
	//- ИнфоСофт Мурсалимов Д.Р. 05.04.24 УА #73236
	
	//+ ИнфоСофт Конышев А.Е. 09.12.24 УА #77940
	ОтображатьРасходныеОрдера = ПолучитьФункциональнуюОпцию("ИспользоватьОрдерныеСклады");	
	//- ИнфоСофт Конышев А.Е. 09.12.24 УА #77940
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628

//+ ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПрименитьНастройкиПрофиля();
	
	//+ ИнфоСофт Конышев А.Е. 12.12.24 УА #78004
	УстановитьОтборыОтправлений();
	//- ИнфоСофт Конышев А.Е. 12.12.24 УА #78004
	
	//+ ИнфоСофт Мурсалимов Д.Р. 23.05.24 УА #70073
	УправлениеФормой();
	//- ИнфоСофт Мурсалимов Д.Р. 23.05.24 УА #70073
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628

//+ ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628
&НаКлиенте
Процедура ПрофильПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Профиль) Тогда
		ПолучитьДатуПоследнегоЗаказа(Профиль, ДатаПоследнегоОтправления);
	КонецЕсли;
	
	ПрименитьНастройкиПрофиля();
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628

//+ ИнфоСофт Стояк Ю.К. 21.03.2023 УА #54628
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекДанные = Элемент.ТекущиеДанные; 
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле = Элементы.Заказ Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если Элемент.ТекущиеДанные.Заказ.Пустая() Тогда
			Возврат;
		КонецЕсли;
		
		ПоказатьЗначение(, Элемент.ТекущиеДанные.Заказ);
	
	ИначеЕсли Поле = Элементы.Реализация Тогда
		
		СтандартнаяОбработка = Ложь;
		
		//+ ИнфоСофт Заварин К.В. 02.12.24 УА #88701
		//Если Не ЗначениеЗаполнено(Элемент.ТекущиеДанные.Реализация) Тогда
		//	Возврат;
		//ИначеЕсли ТипЗнч(Элемент.ТекущиеДанные.Реализация) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		//	ПоказатьЗначение(, Элемент.ТекущиеДанные.Реализация);
		//КонецЕсли 
		
		Если Не ЗначениеЗаполнено(Элемент.ТекущиеДанные.Реализация) Тогда
			Возврат;
		ИначеЕсли ТипЗнч(Элемент.ТекущиеДанные.Реализация) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			ПоказатьЗначение(, Элемент.ТекущиеДанные.Реализация);
		Иначе
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Заказ", Элемент.ТекущиеДанные.Заказ);
			//+ ИнфоСофт Стояк Ю.К. 26.12.2024 УА #90201
			ПараметрыФормы.Вставить("ДокументыРеализации", Истина);
			//- ИнфоСофт Стояк Ю.К. 26.12.2024 УА #90201
			ОткрытьФорму("ОбщаяФорма.ИС_WB_ФормаРТУ", ПараметрыФормы);
		КонецЕсли 
		//- ИнфоСофт Заварин К.В. 02.12.24 УА #88701
		
	//+ ИнфоСофт Конышев А.Е. 10.12.24 УА #77940
	ИначеЕсли Поле = Элементы.РасходныйОрдер Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если Не ЗначениеЗаполнено(Элемент.ТекущиеДанные.РасходныйОрдер) Тогда
			Возврат;
		ИначеЕсли ТипЗнч(Элемент.ТекущиеДанные.РасходныйОрдер) = Тип("ДокументСсылка.РасходныйОрдерНаТовары") Тогда
			ПоказатьЗначение(, Элемент.ТекущиеДанные.РасходныйОрдер);
		//+ ИнфоСофт Стояк Ю.К. 26.12.2024 УА #90201
		Иначе
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Заказ", Элемент.ТекущиеДанные.Заказ);
			ПараметрыФормы.Вставить("ДокументыРеализации", Ложь);
			ОткрытьФорму("ОбщаяФорма.ИС_WB_ФормаРТУ", ПараметрыФормы);
		//- ИнфоСофт Стояк Ю.К. 26.12.2024 УА #90201
		КонецЕсли
	
	//- ИнфоСофт Конышев А.Е. 10.12.24 УА #77940
		
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 21.03.2023 УА #54628

//+ ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628
&НаКлиенте
Процедура ОтображатьСоставЗаказовПриИзменении(Элемент)         
	
	Если ОтображатьСоставЗаказов Тогда
		Элементы.СоставЗаказов.Видимость = Истина;
	Иначе
		Элементы.СоставЗаказов.Видимость = Ложь; 
	КонецЕсли;                                                 
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628

//+ ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	
	//+ ИнфоСофт Мурсалимов Д.Р. 15.11.23 УА #63407
	СписокПриАктивизацииСтрокиНаСервере(ВыделенныеСтроки);
	//Если ОтображатьСоставЗаказов Тогда		
	//	СписокПриАктивизацииСтрокиНаСервере(ВыделенныеСтроки);
	//КонецЕсли; 
	//- ИнфоСофт Мурсалимов Д.Р. 15.11.23 УА #63407
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628

//+ ИнфоСофт Сумин Д.В. 05.02.2024 УА #69650
&НаКлиенте
Процедура ПрикрепитьКиз(Команда) 
	
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран Профиль", , , "Профиль");
		Возврат;
	КонецЕсли;
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	
	Если ВыделенныеСтроки = Неопределено Или ВыделенныеСтроки.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
		"Для прикрепления КиЗов нужно выделить необходимые заказы");
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Профиль", Профиль);
	ПараметрыФормы.Вставить("СборочныеЗадания", ВыделенныеСтроки);
	
	ОткрытьФорму("Документ.ИС_ЯМ_Заказ.Форма.ФормаКиЗов", ПараметрыФормы, ЭтотОбъект);  
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 05.02.2024 УА #69650

//+ ИнфоСофт Конышев А.Е. 12.12.24 УА #78004
&НаКлиенте
Процедура ОтборОтправленийПриИзменении(Элемент)
	УстановитьОтборыОтправлений();
КонецПроцедуры //- ИнфоСофт Конышев А.Е. 12.12.24 УА #78004

#КонецОбласти 

#Область ОбработчикиКомандФормы 

//+ ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628
&НаКлиенте
Процедура ЗагрузитьЗаказы(Команда)
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран Профиль", , , "Профиль");
		Возврат;
	КонецЕсли;
	
	//+ ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207
	РеглРаботает = ПроверитьРегламетноеЗаданиеНаСервере(Профиль, "ПолучениеСборочныхЗаданийЯМ");
	
	Если Не РеглРаботает Тогда    
		
		ДлительнаяОперация = ЗагрузитьЗаказыНаСервере(Профиль, ДатаПоследнегоОтправления, УникальныйИдентификатор);
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ПолучениеЗаказовЗавершение", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания());
		
		Элементы["КартинкаОжидание"].Видимость = Истина;		
		
		//ЗагрузитьЗаказыНаСервере(Профиль, ДатаПоследнегоОтправления);	
		
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Уже выполняется регламентное задание по загрузке заказов, обновите форму чуть позже");
	КонецЕсли;                                                                         	
		 
	//ПолучитьДатуПоследнегоЗаказа(Профиль, ДатаПоследнегоОтправления); 
	
	//Элементы.Список.Обновить();                                                      
	
	//+ ИнфоСофт Сумин Д.В. 15.04.2023 УА #57537 
	//ДатаПоследнегоОтправления = ПолучитьДатуПоследнегоОтправленияНаСервере();
	//- ИнфоСофт Сумин Д.В. 15.04.2023 УА #57537
	//- ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628 

//+ ИнфоСофт Сумин Д.В. 15.04.2023 УА #57537  
&Насервере
Функция ПолучитьДатуПоследнегоОтправленияНаСервере();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИС_ЯМ_Заказ.Дата КАК Дата
	|ИЗ
	|	Документ.ИС_ЯМ_Заказ КАК ИС_ЯМ_Заказ
	|ГДЕ
	|	ИС_ЯМ_Заказ.Профиль = &Профиль
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();

	ДатаНачала = ВыборкаДетальныеЗаписи.Дата;
		
	Если Не ЗначениеЗаполнено(ДатаНачала) Тогда
		ДатаНачала = НачалоДня(ТекущаяДатаСеанса());	
	КонецЕсли;
	
	Возврат ДатаНачала;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 15.04.2023 УА #57537 	

//+ ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628
&НаКлиенте
Процедура СоздатьЗаказы(Команда)
		
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;	
	СоздатьЗаказыНаСервере(ВыделенныеСтроки);
	Элементы.Список.Обновить();
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628

//+ ИнфоСофт Стояк Ю.К. 21.03.2023 УА #54628
&НаКлиенте
Процедура СоздатьРеализации(Команда)
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	СоздатьРеализацииНаСервере(ВыделенныеСтроки);
	Элементы.Список.Обновить();
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 21.03.2023 УА #54628

//+ ИнфоСофт Стояк Ю.К. 21.03.2023 УА #54628
&НаКлиенте
Процедура ОбновитьСтатусы(Команда)
	//+ ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207
	РеглРаботает = ПроверитьРегламетноеЗаданиеНаСервере(Профиль, "ОбновлениеСтатусовСборочныхЗаданийЯМ");
	
	Если Не РеглРаботает Тогда    
		
		ДлительнаяОперация = ОбновитьСтатусыНаСервере();
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбновитьСтатусыЗавершение", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания());
		
		Элементы["КартинкаОжиданиеСтатусы"].Видимость = Истина;		
		
		//ОбновитьСтатусыНаСервере();		
		
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Уже выполняется регламентное задание по загрузке заказов, обновите форму чуть позже");
	КонецЕсли;                                      
	//Элементы.Список.Обновить();
	//- ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 21.03.2023 УА #54628

//+ ИнфоСофт Стояк Ю.К. 21.03.2023 УА #54628
&НаКлиенте
Процедура ПечатьЭтикеток(Команда)
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	МассивФайлов = ПечатьЭтикетокНаСервере(ВыделенныеСтроки); 
	
	Если Не ЗначениеЗаполнено(МассивФайлов) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяКаталогаВременныхФайлов = КаталогВременныхФайлов();  
	
	ИндексФайла = 1;
	
	Для Каждого Файл Из МассивФайлов Цикл                                                          
		
		Если Файл = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяВременногоФайла = ИмяКаталогаВременныхФайлов + Строка(ИндексФайла) + "stickersFile.pdf";
		ИндексФайла = ИндексФайла + 1;
		Файл.Записать(ИмяВременногоФайла);
		
		НачатьЗапускПриложения(Новый ОписаниеОповещения, ИмяВременногоФайла);
		
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 21.03.2023 УА #54628

//+ ИнфоСофт Мурсалимов Д.Р. 21.11.23 УА #56220
&НаКлиенте
Процедура УказатьКоличествоГрузовыхМест(Команда)
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	Заголовок 	= НСтр("ru = 'Введите количество грузовых мест'");
	Оповещение 	= Новый ОписаниеОповещения("УказатьКоличествоГрузовыхМестЗавершение", ЭтотОбъект, ВыделенныеСтроки);
	ПоказатьВводЧисла(Оповещение, 1, Заголовок, 10, 0); 
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 21.11.23 УА #56220

//+ ИнфоСофт Стояк Ю.К. 18.12.2023 УА #63805
&НаКлиенте
Процедура ИзменитьСтатусы(Команда)
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;

	Если ВыделенныеСтроки.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо выбрать отправления");
		Возврат;
	КонецЕсли;
	
	ИзменитьСтатусыНаСервере(ВыделенныеСтроки); 
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 18.12.2023 УА #63805

//+ ИнфоСофт Заварин К.В. 20.03.24 УА #66299
&НаКлиенте
Процедура ПечатьЛистаПодбора(Команда)
    
		ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
			
		Если ВыделенныеСтроки = Неопределено Или ВыделенныеСтроки.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
 	
	ТабДок = ПолучитьЛистПодбораНаСервере(ВыделенныеСтроки);
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("Лист Подбора Яндекс Маркет");
	
	КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабДок;
	КоллекцияПечатныхФорм[0].Экземпляров = 1;
	КоллекцияПечатныхФорм[0].СинонимМакета = "Лист Подбора Яндекс Маркет";
	
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, Неопределено, ЭтотОбъект);

КонецПроцедуры //- ИнфоСофт Заварин К.В. 20.03.24 УА #66299

//+ ИнфоСофт Стояк Ю.К. 03.06.2024 УА #76167
&НаКлиенте
Процедура ОткрытьФормуСборкиЗаказов(Команда)
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Профиль", Профиль);
	
	Если ВыделенныеСтроки.Количество() <> 0 Тогда
		ПараметрыОткрытия.Вставить("ВыделенныеСтроки", ВыделенныеСтроки);
	КонецЕсли;
	
	//+ ИнфоСофт Янгиров Р.Р. 14.11.2024 УА #86762
	//Если в настройках маркетплейса Ozon установлен флаг РазнестиЗаказыНаКоличество, при создании документа "УпаковкаТоваров"
	//создается два документа, в один попадают заказы с единичным количеством позиций, в другой документ с множественным количеством.
	РазнестиЗаказыПоКоличеству = ПолучитьЗначениеПараметра();
	
	Если РазнестиЗаказыПоКоличеству Тогда
		ЭтоОшибка = ИзменитьСтатусыЗаказовЯМ();
		Если ЭтоОшибка Тогда 
			ВызватьИсключение НСтр("ru= 'Не найдены заказы с подходящими параметрами.Перепроверьте статус заказов, и дату их отгрузки'");
		Иначе                          		
			СоздатьДокументыУпаковкиТоваровЯМ(ПараметрыОткрытия);
		КонецЕсли;
	Иначе
		ОткрытьФорму("Документ.ИС_ЯМ_УпаковкаТоваров.Форма.ФормаДокумента", ПараметрыОткрытия, ЭтотОбъект);
	КонецЕсли;                                    
	//ОткрытьФорму("Документ.ИС_ЯМ_УпаковкаТоваров.Форма.ФормаДокумента", ПараметрыОткрытия, ЭтотОбъект);
	//- ИнфоСофт Янгиров Р.Р. 14.11.2024 УА #86762	
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 03.06.2024 УА #76167

//+ ИнфоСофт Заварин К.В. 13.11.24 УА #85881
&НаКлиенте
Процедура ПометитьНаУдалениеПривязанныеДокументы(Команда)
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран Профиль", , , "Профиль");
		Возврат;
	КонецЕсли;
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
			
	Если ВыделенныеСтроки = Неопределено Или ВыделенныеСтроки.Количество() = 0 Тогда
	 	ОбщегоНазначенияКлиент.СообщитьПользователю(
	 		"Для пометки на удаление нужно выделить необходимые сборочные задания");
		Возврат;
	КонецЕсли;
	
	ПометитьНаУдалениеПривязанныеДокументыНаСервере();
	Элементы.Список.Обновить();	
	
	ОбщегоНазначенияКлиент.СообщитьПользователю("Документы успешно помечены на удаление");

	
КонецПроцедуры //- ИнфоСофт Заварин К.В. 13.11.24 УА #85881 

//+ ИнфоСофт Стояк Ю.К. 04.12.2024 УА #73043
&НаКлиенте
Процедура ПеренестиДатуДоставки(Команда)
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;

	Если ВыделенныеСтроки.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо выбрать отправления");
		Возврат;
	КонецЕсли;
	
	Если ПричинаПереносаДоставки = "" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо выбрать причину переноса");
		Возврат;
	КонецЕсли; 
		
	ПеренестиДатуДоставкиНаСервере(ВыделенныеСтроки);
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 04.12.2024 УА #73043

//+ ИнфоСофт Стояк Ю.К. 10.02.2025 УА #77168
&НаКлиенте
Процедура ОткрытьФормуНастройкиЛистаПодбора(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Профиль", Профиль);
	ОткрытьФорму("Документ.ИС_ЯМ_Заказ.Форма.ФормаНастройкиЛистаПодбора",ПараметрыФормы , , , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 10.02.2025 УА #77168

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Мурсалимов Д.Р. 23.05.24 УА #70073 
&НаКлиенте
Процедура УправлениеФормой()
	
	Элементы.СоставЗаказов.Видимость = ОтображатьСоставЗаказов;
	
	//+ ИнфоСофт Конышев А.Е. 09.12.24 УА #77940
	Если Не ОтображатьРасходныеОрдера Тогда	
		Элементы.РасходныйОрдер.Видимость = Ложь;	
	КонецЕсли;                               
	//- ИнфоСофт Конышев А.Е. 09.12.24 УА #77940
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 23.05.24 УА #70073

//+ ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628
&НаКлиенте
Процедура ПрименитьНастройкиПрофиля()

	Если ЗначениеЗаполнено(Профиль) Тогда
		ПолучитьДатуПоследнегоЗаказа(Профиль, ДатаПоследнегоОтправления);
	КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("Профиль", Профиль); 
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628

//+ ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628
&НаСервереБезКонтекста
Процедура ПолучитьДатуПоследнегоЗаказа(Профиль, Дата) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИС_ЯМ_Заказ.Дата КАК Дата
		|ИЗ
		|	Документ.ИС_ЯМ_Заказ КАК ИС_ЯМ_Заказ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата УБЫВ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Дата = ВыборкаДетальныеЗаписи.Дата;
	КонецЦикла;
	 
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628

&НаСервере
Процедура СоздатьЗаказыНаСервере(ВыделенныеСтроки)	
	
	Если ЗначениеЗаполнено(ВыделенныеСтроки) Тогда
		ИС_ЯМ_Сервер.СоздатьЗаказы(Профиль, ВыделенныеСтроки);
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 19.02.23 УА #53535  

//+ ИнфоСофт Ивонин К.А. 19.02.23 УА #53535
&НаСервере
Процедура СоздатьРеализацииНаСервере(ВыделенныеСтроки)

	Если ЗначениеЗаполнено(ВыделенныеСтроки) Тогда
		ИС_ЯМ_Сервер.СоздатьРеализации(Профиль, ВыделенныеСтроки);
	КонецЕсли;	
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 19.02.23 УА #53535

//+ ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628
&НаСервереБезКонтекста
Функция  ЗагрузитьЗаказыНаСервере(Профиль, ДатаПоследнегоОтправления, УникальныйИдентификатор)
	
	Если ДатаПоследнегоОтправления = Дата(1, 1, 1) Тогда
		ДатаПоследнегоОтправления = НачалоДня(ТекущаяДатаСеанса());
	КонецЕсли; 
	
	//+ ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	
	Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, 
	"ИС_ЯМ_Сервер.ПолучитьСписокЗаказов", Профиль, ДатаПоследнегоОтправления);
	
	//ИС_ЯМ_Сервер.ПолучитьСписокЗаказов(Профиль, ДатаПоследнегоОтправления);
	//- ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207		
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628

//+ ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628
Процедура СписокПриАктивизацииСтрокиНаСервере(ВыделенныеСтроки)
	
	СоставЗаказов.Очистить();
	
	Для Каждого Строка Из ВыделенныеСтроки Цикл
		Если ТипЗнч(Строка) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	//+ ИнфоСофт Сумин Д.В. 15.04.2023 УА #57537
	"ВЫБРАТЬ
	|	ИС_ЯМ_Заказproducts.Ссылка КАК Ссылка,
	|	ИС_ЯМ_Заказproducts.НоменклатураЯМ КАК Номенклатура,
	|	ИС_ЯМ_Заказproducts.ШтрихкодЯМ КАК Штрихкод,
	|	ИС_ЯМ_Заказproducts.count КАК Количество,
	|	ИС_ЯМ_Заказproducts.Сумма КАК Сумма,
	|	ИС_ЯМ_Заказproducts.price КАК Цена,
	|	ИС_ЯМ_Заказproducts.shipmentDate КАК shipmentDate
	|ИЗ
	|	Документ.ИС_ЯМ_Заказ.items КАК ИС_ЯМ_Заказproducts
	|ГДЕ
	|	ИС_ЯМ_Заказproducts.Ссылка В(&ВыделенныеСтроки)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИС_ЯМ_Заказproducts.Ссылка.Дата УБЫВ";
	//- ИнфоСофт Сумин Д.В. 15.04.2023 УА #57537
	
	Запрос.УстановитьПараметр("ВыделенныеСтроки", ВыделенныеСтроки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = СоставЗаказов.Добавить();
		НоваяСтрока.Заказ = ВыборкаДетальныеЗаписи.Ссылка;
		НоваяСтрока.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;		
		НоваяСтрока.Штрихкод = ВыборкаДетальныеЗаписи.Штрихкод;
		НоваяСтрока.Количество = ВыборкаДетальныеЗаписи.Количество;		
		НоваяСтрока.Цена = ВыборкаДетальныеЗаписи.Цена;	
		НоваяСтрока.Сумма = ВыборкаДетальныеЗаписи.Сумма;
		//+ ИнфоСофт Сумин Д.В. 15.04.2023 УА #57537
		НоваяСтрока.ДатаОтгрузки = ВыборкаДетальныеЗаписи.shipmentDate; 
		//- ИнфоСофт Сумин Д.В. 15.04.2023 УА #57537
	КонецЦикла;		
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628

//+ ИнфоСофт Стояк Ю.К. 21.03.2023 УА #54628
&НаСервере
Функция ОбновитьСтатусыНаСервере()
	
	//+ ИнфоСофт Стояк Ю.К. 08.04.2024 УА #68800         
	ФукнциональныеОпции = ИС_ЯМ_Сервер.ПолучитьНастройкиФункциональностиСборочныхЗвданий(Профиль); 
	
	Если Не ЗначениеЗаполнено(ФукнциональныеОпции) Тогда
		Период = 30 * 86400;
	Иначе
		Период = ФукнциональныеОпции.ЯндексКоличествоДнейОбновлениеСтатусов * 86400;
	КонецЕсли;  
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	
	Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, 
	"ИС_ЯМ_Сервер.ОбновитьСтатусыСборочныхЗаданий", Профиль, Период);
		
	//ИС_ЯМ_Сервер.ОбновитьСтатусыСборочныхЗаданий(Профиль);
	//- ИнфоСофт Стояк Ю.К. 08.04.2024 УА #68800
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 21.03.2023 УА #54628

//+ ИнфоСофт Стояк Ю.К. 21.03.2023 УА #54628
&НаСервере
Функция ПечатьЭтикетокНаСервере(ВыделенныеСтроки)           
	Возврат ИС_ЯМ_Сервер.НапечататьЭтикетки(Профиль, ВыделенныеСтроки); 	
КонецФункции //- ИнфоСофт Стояк Ю.К. 21.03.2023 УА #54628

//+ ИнфоСофт Ивонин К.А. 08.04.24 УА #73304
&НаКлиенте
Процедура УказатьКоличествоГрузовыхМестЗавершение(Результат, ДопПараметры) Экспорт

	Если Результат = Неопределено Тогда // Отменено пользователем
		Возврат;
	КонецЕсли;
	
	Если Результат = 0 Тогда
		Возврат;
	КонецЕсли;
	
	УказатьКоличествоГрузовыхМестНаСервере(Профиль, Результат, ДопПараметры);

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 08.04.24 УА #73304

//+ ИнфоСофт Мурсалимов Д.Р. 21.11.23 УА #56220
&НаСервереБезКонтекста
Процедура УказатьКоличествоГрузовыхМестНаСервере(Знач Профиль, Знач Количество, Знач ВыделенныеСтроки)
	ИС_ЯМ_Сервер.УказатьКоличествоГрузовыхМест(Профиль, ВыделенныеСтроки, Количество);
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 21.11.23 УА #56220

//+ ИнфоСофт Стояк Ю.К. 18.12.2023 УА #63805
&НаСервере
Процедура ИзменитьСтатусыНаСервере(ВыделенныеСтроки)
	ИС_ЯМ_Сервер.ИзменитьСтатусыЗаказов(Профиль, ВыделенныеСтроки, Статус, ДетальныйСтатус);	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 18.12.2023 УА #63805

//+ ИнфоСофт Стояк Ю.К. 10.02.2025 УА #77168
&НаСервере
Функция ПолучитьЛистПодбораНаСервере(ВыделенныеСтроки) 
	
	Табдок = Новый ТабличныйДокумент;
	
	Табдок.ИмяПараметровПечати = "ИС_ЯМ_ПечатьЛистаПодбора";
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;  
	ТабДок.АвтоМасштаб = Истина;
	
	ТабДок.ПолеСправа = 7;
	
	МакетОбработки = УправлениеПечатью.МакетПечатнойФормы("Документ.ИС_ЯМ_Заказ.ПФ_MXL_ЛистПодбора");	
		
	МассивЗначений = Новый Массив;	
	МассивЗначений.Добавить("ПечататьНомерСтроки");       	
	МассивЗначений.Добавить("ПечататьНомерСборочного");
	МассивЗначений.Добавить("ПечататьНомерЗаказа"); 
	МассивЗначений.Добавить("ПечататьНомерРеализации");   		
	МассивЗначений.Добавить("ПечататьНазвание");	    
	МассивЗначений.Добавить("ПечататьРазмер");	
	МассивЗначений.Добавить("ПечататьАртикулЯМ");
	МассивЗначений.Добавить("ПечататьАртикул1С");	
	МассивЗначений.Добавить("ПечататьШтрихкод");
	МассивЗначений.Добавить("ПечататьКоличество");   	
	МассивЗначений.Добавить("ПечататьФото");
	
	НастройкиПечати = ИС_МП_Печать.ПолучитьНастройкиПечатиЛистаПодбора(Профиль, МассивЗначений, Перечисления.ИС_МП_Маркетплейсы.ЯМ);	
	
	ОбластьШапка = МакетОбработки.ПолучитьОбласть("Шапка|ОсновнойЛист");
	ОбластьШапка.Параметры.Дата = ТекущаяДатаСеанса();
	ОбластьШапка.Параметры.Профиль = Профиль;		
	
	Если ЗначениеЗаполнено(СортировкаПечати) Тогда	
		ОбластьШапка.Параметры.Сорт = Элементы.СортировкаПечати.СписокВыбора.НайтиПоЗначению(СортировкаПечати).Представление;
	Иначе
		СортировкаПечати = "НомерЗадания";
		ОбластьШапка.Параметры.Сорт = Элементы.СортировкаПечати.СписокВыбора.НайтиПоЗначению(СортировкаПечати).Представление;
	КонецЕсли;                                  	
	
	Табдок.Вывести(ОбластьШапка);
	
	ИС_МП_Печать.ЗаполнитьШапкуТаблицыЛистаПодбора(Табдок, МакетОбработки, НастройкиПечати, МассивЗначений);	
	
	Запрос = Новый Запрос;
	Запрос.Текст =	
	"ВЫБРАТЬ
	|	ИС_ЯМ_Заказ.Ссылка КАК Ссылка,
	|	ПередачаТоваровХранителюТовары.Ссылка.Номер КАК НомерРеализации
	|ПОМЕСТИТЬ ВТ_РТУ
	|ИЗ
	|	Документ.ИС_ЯМ_Заказ КАК ИС_ЯМ_Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровХранителю.Товары КАК ПередачаТоваровХранителюТовары
	|		ПО (ИС_ЯМ_Заказ.Заказ = ПередачаТоваровХранителюТовары.ЗаказКлиента)
	|			И (НЕ ИС_ЯМ_Заказ.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка))
	|ГДЕ
	|	НЕ ИС_ЯМ_Заказ.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|	И НЕ ПередачаТоваровХранителюТовары.Ссылка ЕСТЬ NULL
	|	И ИС_ЯМ_Заказ.Ссылка В(&МассивСсылок)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ИС_ЯМ_Заказ.Ссылка,
	|	РеализацияТоваровУслугТовары.Ссылка.Номер
	|ИЗ
	|	Документ.ИС_ЯМ_Заказ КАК ИС_ЯМ_Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		ПО ИС_ЯМ_Заказ.Заказ = РеализацияТоваровУслугТовары.ЗаказКлиента
	|			И (НЕ ИС_ЯМ_Заказ.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка))
	|ГДЕ
	|	НЕ ИС_ЯМ_Заказ.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|	И НЕ РеализацияТоваровУслугТовары.Ссылка ЕСТЬ NULL
	|	И ИС_ЯМ_Заказ.Ссылка В(&МассивСсылок)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИС_ЯМ_Заказitems.Ссылка.Номер КАК НомерЗадания,
	|	ИС_ЯМ_Заказitems.Ссылка.Дата КАК Дата,
	|	ИС_ЯМ_Заказitems.НоменклатураЯМ.Наименование КАК Наименование,
	|	ИС_ЯМ_СоответствиеХарактеристик.Характеристика КАК Размер,
	|	ЕСТЬNULL(ИС_ЯМ_СоответствиеХарактеристик.НоменклатураЯМ.shopSku, ""Отсутствует сопоставление"") КАК Артикул,
	|	ИС_ЯМ_Заказitems.ШтрихкодЯМ.Штрихкод КАК Штрихкод,
	|	ИС_ЯМ_СоответствиеХарактеристик.Номенклатура.ФайлКартинки КАК ФайлКартинки,
	|	ИС_ЯМ_СоответствиеХарактеристик.Номенклатура КАК Номенклатура,             	
	|	ИС_ЯМ_Заказitems.count КАК Количество,
	|	ИС_ЯМ_СоответствиеХарактеристик.Номенклатура.Артикул КАК НоменклатураАртикул,
	|	ИС_ЯМ_Заказitems.Ссылка.Заказ.Номер КАК НомерЗаказа,
	|	ВЫБОР
	|		КОГДА ИС_ЯМ_Заказitems.Ссылка.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|			ТОГДА """"""""
	|		ИНАЧЕ МИНИМУМ(ВТ_РТУ.НомерРеализации)
	|	КОНЕЦ КАК НомерРеализации               	
	|ИЗ
	|	Документ.ИС_ЯМ_Заказ.items КАК ИС_ЯМ_Заказitems
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_ЯМ_СоответствиеХарактеристик КАК ИС_ЯМ_СоответствиеХарактеристик
	|		ПО (ИС_ЯМ_Заказitems.НоменклатураЯМ.Ссылка = ИС_ЯМ_СоответствиеХарактеристик.НоменклатураЯМ.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_ЯМ_СтатусыСборочныхЗаданий КАК ИС_ЯМ_СтатусыСборочныхЗаданий
	|		ПО (ИС_ЯМ_Заказitems.Ссылка.Номер = ИС_ЯМ_СтатусыСборочныхЗаданий.Заказ.Номер)	
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РТУ КАК ВТ_РТУ
	|		ПО ИС_ЯМ_Заказitems.Ссылка = ВТ_РТУ.Ссылка
	|ГДЕ
	|	ИС_ЯМ_Заказitems.Ссылка В (&МассивСсылок)
	|	И ИС_ЯМ_СтатусыСборочныхЗаданий.status <> ЗНАЧЕНИЕ(Перечисление.ИС_ЯМ_СтатусыЗаказов.CANCELLED)
	|	И ИС_ЯМ_СтатусыСборочныхЗаданий.status <> ЗНАЧЕНИЕ(Перечисление.ИС_ЯМ_СтатусыЗаказов.CANCELLED_WITHOUT_REFUND)
	|
	|СГРУППИРОВАТЬ ПО
	|	ИС_ЯМ_Заказitems.Ссылка.Номер,
	|	ИС_ЯМ_Заказitems.Ссылка.Дата,
	|	ИС_ЯМ_Заказitems.НоменклатураЯМ.Наименование,
	|	ИС_ЯМ_СоответствиеХарактеристик.Характеристика,
	|	ИС_ЯМ_Заказitems.ШтрихкодЯМ.Штрихкод,
	|	ИС_ЯМ_СоответствиеХарактеристик.Номенклатура.ФайлКартинки,
	|	ИС_ЯМ_СоответствиеХарактеристик.Номенклатура,	
	|	ИС_ЯМ_Заказitems.count,
	|	ИС_ЯМ_СоответствиеХарактеристик.Номенклатура.Артикул,
	|	ИС_ЯМ_Заказitems.Ссылка.Заказ.Номер,
	|	ЕСТЬNULL(ИС_ЯМ_СоответствиеХарактеристик.НоменклатураЯМ.shopSku, ""Отсутствует сопоставление""),
	|	ИС_ЯМ_Заказitems.Ссылка.Заказ           	
	|
	|УПОРЯДОЧИТЬ ПО
	|	%1";
		
	БуферСортировкаПечати = СортировкаПечати;  
	Если БуферСортировкаПечати = "Наименование" Тогда
		БуферСортировкаПечати = "Наименование, Размер";
	ИначеЕсли БуферСортировкаПечати = "SKU" Тогда		
		БуферСортировкаПечати = "Артикул";
	КонецЕсли;
	
	Запрос.Текст = СтрШаблон(Запрос.Текст, БуферСортировкаПечати);
	
	Запрос.УстановитьПараметр("МассивСсылок", ВыделенныеСтроки);

	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю("Не удалось сформировать лист подбора");
		Возврат Табдок;	
	КонецЕсли;
	
	Эталон = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ИС_МП_Эталон");
	
	КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ВысотаОбластей = Табдок.ВысотаТаблицы;
	
	Если ВыводитьКомплектующие Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =	
		"ВЫБРАТЬ
		|	ВТ.НомерЗадания КАК НомерЗадания,
		|	ВТ.Номенклатура КАК Номенклатура,		
		|	ВТ.Размер КАК Размер,
		|	ВТ.Штрихкод КАК Штрихкод		
		|	ПОМЕСТИТЬ ВТ_Номенклатура
		|ИЗ
		|	&ВТ КАК ВТ
		|;
		|		
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Номенклатура.НомерЗадания КАК НомерЗадания,
		|	ВТ_Номенклатура.Номенклатура КАК Номенклатура,		
		|	ВТ_Номенклатура.Размер КАК Размер,
		|	ВТ_Номенклатура.Штрихкод КАК Штрихкод,
		|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК НоменклатураНабора,
		|	ВариантыКомплектацииНоменклатурыТовары.Характеристика КАК ХарактеристикаНабора,
		|	ВариантыКомплектацииНоменклатурыТовары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура.ФайлКартинки КАК ФайлКартинки,
		|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура.Артикул КАК Артикул
		|ИЗ
		|	СоставНаборов.НоменклатураНабора <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
		|		ПО ВТ_Номенклатура.Номенклатура = ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец
		|			И ВТ_Номенклатура.Размер = ВариантыКомплектацииНоменклатурыТовары.Ссылка.Характеристика
		|ГДЕ
		|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура.Наименование";    
		
		Запрос.УстановитьПараметр("ВТ", РезультатЗапроса.Выгрузить());
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыгрузкаНаборы = РезультатЗапроса.Выгрузить(); 
		
	КонецЕсли;
			
	НомерСтроки = 0;	
	
	Пока Выборка.Следующий() Цикл 
		
		ОбластьВыведена = Ложь; 
		
		Для Каждого Параметр Из МассивЗначений Цикл
			
			Если НастройкиПечати[Параметр] Тогда
				
				ОбластьСтроки = МакетОбработки.ПолучитьОбласть("ДанныеСтроки|" + Сред(Параметр, 9));
				
				ЗаполнитьЗначенияСвойств(ОбластьСтроки.Параметры, Выборка);
				
				Если Параметр = "ПечататьНомерСтроки" Тогда             
					НомерСтроки = НомерСтроки + 1;
					ОбластьСтроки.Параметры.НомерСтроки = НомерСтроки;						
				КонецЕсли;
				
				Если Параметр = "ПечататьНазвание" Тогда
					ОбластьСтроки.Параметры.Название = СтрШаблон("%1 %2", Выборка.Номенклатура, Выборка.Размер);	
				КонецЕсли; 
				
				Если Параметр = "ПечататьШтрихкод" Тогда
					
					ПараметрыШК = ИС_MP_ГенерацияШтрихкода.ПараметрыГенерацииШтрихкода();
					
					ПараметрыШК.Ширина = Окр(ОбластьСтроки.Рисунки.КартинкаШК.Ширина / КоличествоМиллиметровВПикселе);
					ПараметрыШК.Высота = Окр(ОбластьСтроки.Рисунки.КартинкаШК.Высота / КоличествоМиллиметровВПикселе);
					ПараметрыШК.РазмерШрифта = 10;
					ПараметрыШК.ТипКода = 4;
					ПараметрыШК.Штрихкод = Выборка.Штрихкод;
					ПараметрыШК.Масштабировать = Истина;
					ПараметрыШК.СохранятьПропорции = Истина;
					ПараметрыШК.ВертикальноеВыравнивание = 2; 
					
					СтруктураКартинки = ИС_MP_ГенерацияШтрихкода.ИзображениеШтрихкода(ПараметрыШК);
					
					Если СтруктураКартинки.Результат Тогда	
						ОбластьСтроки.Рисунки.КартинкаШК.Картинка = СтруктураКартинки.Картинка;
					КонецЕсли; 
					
				КонецЕсли;
				
				Если Параметр = "ПечататьФото" И ЗначениеЗаполнено(Выборка.ФайлКартинки) Тогда
					ОбластьСтроки.Рисунки.КартинкаТовара.Картинка = Новый Картинка(РаботаСФайлами.ДвоичныеДанныеФайла(Выборка.ФайлКартинки));
				КонецЕсли;
				
				Если ОбластьВыведена Тогда
					ТабДок.Присоединить(ОбластьСтроки);	
				Иначе  
					ТабДок.Вывести(ОбластьСтроки);
					ВысотаОбластей = ВысотаОбластей + ОбластьСтроки.ВысотаТаблицы;
					ОбластьВыведена = Истина;
				КонецЕсли; 
				
				Если ВысотаОбластей + ОбластьСтроки.ВысотаТаблицы >= 71 Тогда 					
					Табдок.ВывестиГоризонтальныйРазделительСтраниц();
					ВысотаОбластей = 0;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
						
		Если ВыводитьКомплектующие И ВыгрузкаНаборы.Количество() > 0 Тогда                    
			
			НайденныеСтроки = ВыгрузкаНаборы.НайтиСтроки(Новый Структура("Номенклатура, Характеристика", Выборка.Номенклатура, Выборка.Размер));
			
			Если НайденныеСтроки.Количество() > 0 Тогда
				
				Для Каждого Строка Из НайденныеСтроки Цикл
					
					Для Каждого Строка Из НайденныеСтроки Цикл
						
						ОбластьВыведена = Ложь; 
						
						Для Каждого Параметр Из МассивЗначений Цикл
							
							Если НастройкиПечати[Параметр] Тогда
								
								ОбластьСтроки = МакетОбработки.ПолучитьОбласть("ДанныеСтроки|" + Сред(Параметр, 9));
								
								ЗаполнитьЗначенияСвойств(ОбластьСтроки.Параметры, Строка);  
								
								Если Параметр = "ПечататьНазвание" Тогда
									ОбластьСтроки.Параметры.Название     = СтрШаблон("Комплектующая набора: %1 %2 в количестве %3", Строка.НоменклатураНабора, Строка.ХарактеристикаНабора, Строка.КоличествоУпаковок);
								КонецЕсли; 
								
								Если Параметр = "ПечататьФото" И ЗначениеЗаполнено(Строка.ФайлКартинки) Тогда								
									ОбластьСтроки.Рисунки.КартинкаТовараНабор.Картинка = Новый Картинка(РаботаСФайлами.ДвоичныеДанныеФайла(Строка.ФайлКартинки));								
								КонецЕсли;
								
								Если ОбластьВыведена Тогда
									ТабДок.Присоединить(ОбластьСтроки);	
								Иначе  
									ТабДок.Вывести(ОбластьСтроки);
									ВысотаОбластей = ВысотаОбластей + ОбластьСтроки.ВысотаТаблицы;
									ОбластьВыведена = Истина;
								КонецЕсли; 
								
								Если ВысотаОбластей + ОбластьСтроки.ВысотаТаблицы >= 71 Тогда 					
									Табдок.ВывестиГоризонтальныйРазделительСтраниц();
									ВысотаОбластей = 0;
								КонецЕсли;
								
							КонецЕсли;
							
						КонецЦикла;
						
						ВыгрузкаНаборы.Удалить(Строка);
						
					КонецЦикла; 
					
				КонецЦикла;
				
			КонецЕсли; 	    
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Табдок;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 10.02.2025 УА #77168

//+ ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207
&НаКлиенте
Функция ПараметрыОжидания()

	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);	
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	Возврат ПараметрыОжидания;

КонецФункции //- ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207

//+ ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207
&НаКлиенте
Процедура ПолучениеЗаказовЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    Элементы["КартинкаОжидание"].Видимость = Ложь;
    
    Если Результат = Неопределено Тогда  // отменено пользователем
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);	
	КонецЕсли;
	
	Если Результат.Сообщения.Количество() > 0 Тогда
		
		Для Каждого Элемент Из Результат.Сообщения Цикл
			ОбщегоНазначенияКлиент.СообщитьПользователю(Элемент.Текст);
		КонецЦикла;
		
	КонецЕсли; 
	
	ДатаПоследнегоОтправления = ПолучитьДатуПоследнегоОтправленияНаСервере();
	
	Элементы.Список.Обновить();
	
	УдалитьИзВременногоХранилища(Результат.АдресРезультата);
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207

//+ ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207
&НаКлиенте
Процедура ОбновитьСтатусыЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    Элементы["КартинкаОжиданиеСтатусы"].Видимость = Ложь;
    
    Если Результат = Неопределено Тогда  // отменено пользователем
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);	
	КонецЕсли;
	
	Если Результат.Сообщения.Количество() > 0 Тогда
		
		Для Каждого Элемент Из Результат.Сообщения Цикл
			ОбщегоНазначенияКлиент.СообщитьПользователю(Элемент.Текст);
		КонецЦикла;
		
	КонецЕсли;
	
	Элементы.Список.Обновить();
	
	УдалитьИзВременногоХранилища(Результат.АдресРезультата);
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207

//+ ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207
&НаСервереБезКонтекста
Функция ПроверитьРегламетноеЗаданиеНаСервере(Профиль, ИмяКоманды)
	
	РеглАктивен = Ложь;
	
	Если Не РегламентныеЗаданияСервер.РаботаСВнешнимиРесурсамиЗаблокирована() Тогда
		
		УникальныйИдентификатор = ИС_MP_РаботаСРегламентнымиЗаданиями.ПолучитьУникальныйИдентификаторРегламентогоЗадания(Профиль, ИмяКоманды);
		
		Если ЗначениеЗаполнено(УникальныйИдентификатор) Тогда
			
			Попытка
				УстановитьПривилегированныйРежим(Истина);
				РегламентноеЗадание = РегламентныеЗаданияСервер.ПолучитьРегламентноеЗадание(УникальныйИдентификатор);
				
				РеглАктивен = ИС_MP_РаботаСРегламентнымиЗаданиями.ФоновоеЗаданиеАктивно(РегламентноеЗадание);
				УстановитьПривилегированныйРежим(Ложь);	 
			Исключение
				РеглАктивен = Ложь;
			КонецПопытки;	
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат РеглАктивен;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207  

//+ ИнфоСофт Заварин К.В. 13.11.24 УА #85881
&НаСервере
Процедура ПометитьНаУдалениеПривязанныеДокументыНаСервере()
	
	Событие = "ИС_ЯМ_Заказ.ПометитьНаУдалениеПривязанныеДокументыНаСервере";
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	
	Для Каждого Строка Из ВыделенныеСтроки Цикл
		
		ИС_MP_РаботаСЗаказами.ПометитьНаУдалениеПривязанныеДокументы(Строка.Заказ);
		
		СтрокаСборочноеЗадание = Строка.ПолучитьОбъект();
		
		СтрокаСборочноеЗадание.ПометкаУдаления = Истина; 			
		
		Попытка	
			СтрокаСборочноеЗадание.Записать();
		Исключение 
			
			Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
			
		КонецПопытки;
		
	КонецЦикла;
		
КонецПроцедуры //- ИнфоСофт Заварин К.В. 13.11.24 УА #85881

//+ ИнфоСофт Стояк Ю.К. 04.12.2024 УА #73043
&НаСервере
Процедура ПеренестиДатуДоставкиНаСервере(ВыделенныеСтроки)
	
	Если НоваяДатаДоставкиДБС = Дата('00010101') Или НоваяДатаДоставкиДБС < ТекущаяДатаСеанса() Тогда
		ОбщегоНазначения.СообщитьПользователю("Необходимо указать корректную дату");
		Возврат;
	КонецЕсли;
	
	ИС_ЯМ_Сервер.ИзменитьДатуДоставкиДБС(Профиль, ВыделенныеСтроки, НоваяДатаДоставкиДБС, ПричинаПереносаДоставки);	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 04.12.2024 УА #73043

//+ ИнфоСофт Конышев А.Е. 12.12.24 УА #78004
&НаКлиенте
Процедура УстановитьОтборыОтправлений()
    
    ВсеОтправления = Ложь;
	ВидимостьПечатьЭтикеток = Ложь;
	ВидимостьПрикрепитьКИЗ = Ложь;
	ВидимостьУпаковкаТоваров = Ложь;
	
	Статусы = Новый Массив;

	Если ОтборОтправлений = "В ожидании" Тогда                                                  		

		Статусы.Добавить(ПредопределенноеЗначение("Перечисление.ИС_ЯМ_СтатусыЗаказов.PENDING"));
		
	ИначеЕсли ОтборОтправлений = "Не оплачен" Тогда
		
		Статусы.Добавить(ПредопределенноеЗначение("Перечисление.ИС_ЯМ_СтатусыЗаказов.UNPAID"));	
		
	ИначеЕсли ОтборОтправлений = "Размещен" Тогда
		
		Статусы.Добавить(ПредопределенноеЗначение("Перечисление.ИС_ЯМ_СтатусыЗаказов.PLACING"));
		
		ВидимостьПечатьЭтикеток = Истина;
		ВидимостьПрикрепитьКИЗ = Истина;
		ВидимостьУпаковкаТоваров = Истина;
		
	ИначеЕсли ОтборОтправлений = "Зарезервирован" Тогда
		
		Статусы.Добавить(ПредопределенноеЗначение("Перечисление.ИС_ЯМ_СтатусыЗаказов.RESERVED"));
		
		ВидимостьПечатьЭтикеток = Истина;
		ВидимостьПрикрепитьКИЗ = Истина;
		ВидимостьУпаковкаТоваров = Истина;
		
	ИначеЕсли ОтборОтправлений = "В процессе" Тогда
		
		Статусы.Добавить(ПредопределенноеЗначение("Перечисление.ИС_ЯМ_СтатусыЗаказов.PROCESSING"));
				
		ВидимостьПечатьЭтикеток = Истина;
		ВидимостьПрикрепитьКИЗ = Истина;
		ВидимостьУпаковкаТоваров = Истина;
					
	ИначеЕсли ОтборОтправлений = "В доставке" Тогда
			
		Статусы.Добавить(ПредопределенноеЗначение("Перечисление.ИС_ЯМ_СтатусыЗаказов.DELIVERY"));
		Статусы.Добавить(ПредопределенноеЗначение("Перечисление.ИС_ЯМ_СтатусыЗаказов.PICKUP"));
						
	ИначеЕсли ОтборОтправлений = "Доставлены" Тогда
			
		Статусы.Добавить(ПредопределенноеЗначение("Перечисление.ИС_ЯМ_СтатусыЗаказов.DELIVERED"));
		
	ИначеЕсли ОтборОтправлений = "Возвращены" Тогда
		
		Статусы.Добавить(ПредопределенноеЗначение("Перечисление.ИС_ЯМ_СтатусыЗаказов.RETURNED"));
		Статусы.Добавить(ПредопределенноеЗначение("Перечисление.ИС_ЯМ_СтатусыЗаказов.PARTIALLY_RETURNED"));	
				
	ИначеЕсли ОтборОтправлений = "Отменены" Тогда
		
		Статусы.Добавить(ПредопределенноеЗначение("Перечисление.ИС_ЯМ_СтатусыЗаказов.CANCELLED")); 
		Статусы.Добавить(ПредопределенноеЗначение("Перечисление.ИС_ЯМ_СтатусыЗаказов.CANCELLED_WITHOUT_REFUND"));
		
	ИначеЕсли ОтборОтправлений = "Спорные" Тогда
		
		Статусы.Добавить(ПредопределенноеЗначение("Перечисление.ИС_ЯМ_СтатусыЗаказов.REJECTED"));		
		Статусы.Добавить(ПредопределенноеЗначение("Перечисление.ИС_ЯМ_СтатусыЗаказов.UNKNOWN"));
				
	Иначе // Все
	
		ВсеОтправления = Истина;
		Статусы.Добавить(ПредопределенноеЗначение("Перечисление.ИС_ЯМ_СтатусыЗаказов.ПустаяСсылка")); 
		ВидимостьПечатьЭтикеток = Истина;
		ВидимостьПрикрепитьКИЗ = Истина;
		ВидимостьУпаковкаТоваров = Истина;
		
	КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("ВсеОтправления", ВсеОтправления); 
	Список.Параметры.УстановитьЗначениеПараметра("Статусы", Статусы);
	Элементы.ПечатьЭтикеток.Видимость = ВидимостьПечатьЭтикеток;
	Элементы.ПрикрепитьКиз.Видимость = ВидимостьПрикрепитьКИЗ;
	Элементы.ОткрытьФормуСборкиЗаказов.Видимость = ВидимостьУпаковкаТоваров;
	
КонецПроцедуры //- ИнфоСофт Конышев А.Е. 12.12.24 УА #78004

//+ ИнфоСофт Янгиров Р.Р. 14.11.2024 УА #86762
&НаСервере
Функция ПолучитьЗначениеПараметра()
	
	МассивНаименованийПараметров = Новый Массив;  	
	МассивНаименованийПараметров.Добавить("РазнестиЗаказыПоКоличеству");
		
	Настройки = ИС_МП_Сервер.ПолучитьЗначениеНастроек(Профиль, Перечисления.ИС_МП_Маркетплейсы.ЯМ, МассивНаименованийПараметров);
	
	Если Настройки.Свойство("РазнестиЗаказыПоКоличеству") И ТипЗнч(Настройки.РазнестиЗаказыПоКоличеству) = Тип("Булево") Тогда
		Возврат Настройки.РазнестиЗаказыПоКоличеству;
	Иначе
		Возврат Ложь;
	КонецЕсли;	
	
КонецФункции //- ИнфоСофт Янгиров Р.Р. 14.11.2024 УА #86762

//+ ИнфоСофт Янгиров Р.Р. 14.11.2024 УА #86762
&НаСервере
Функция ПреобразоватьДеревоВТаблицуЗначений(ДеревоЗначений, ТекущийОбъект)
	
	Для Каждого Строка Из ДеревоЗначений.Строки Цикл
		
		Если Строка.Строки.Количество() = 0 Тогда
			
			НоваяСтрока = ТекущийОбъект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
				
		ИначеЕсли Строка.Строки.Количество() > 0 Тогда
			
			ПреобразоватьДеревоВТаблицуЗначений(Строка, ТекущийОбъект);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТекущийОбъект;	
КонецФункции //- ИнфоСофт Янгиров Р.Р. 14.11.2024 УА #86762

//+ ИнфоСофт Янгиров Р.Р. 14.11.2024 УА #86762
&НаСервере
Функция ЗаполнитьДанныеЗаказаНаСервере(Итератор)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИС_ЯМ_СтатусыСборочныхЗаданий.Заказ КАК Заказ
	|ПОМЕСТИТЬ ВТ_СборочныеЗадания
	|ИЗ
	|	РегистрСведений.ИС_ЯМ_СтатусыСборочныхЗаданий КАК ИС_ЯМ_СтатусыСборочныхЗаданий
	|ГДЕ
	|	ИС_ЯМ_СтатусыСборочныхЗаданий.Профиль = &Профиль
	|	И ИС_ЯМ_СтатусыСборочныхЗаданий.status = ЗНАЧЕНИЕ(Перечисление.ИС_ЯМ_СтатусыЗаказов.PROCESSING)
	|	И ИС_ЯМ_СтатусыСборочныхЗаданий.substatus = ЗНАЧЕНИЕ(Перечисление.ИС_ЯМ_ДетальныеСтатусы.READY_TO_SHIP)
	|	И ИС_ЯМ_СтатусыСборочныхЗаданий.Заказ.shipmentDate МЕЖДУ &ДатаОт И &ДатаДо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИС_ЯМ_Заказ_items.Ссылка КАК СборочноеЗадание,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ИС_ЯМ_СоответствиеХарактеристик.Номенклатура) КАК Номенклатура,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ИС_ЯМ_СоответствиеХарактеристик.Характеристика) КАК Характеристика,
	|	СУММА(ИС_ЯМ_Заказ_items.count) КАК КоличествоЗаказ
	|ПОМЕСТИТЬ ВТ_Заказы
	|ИЗ
	|	Документ.ИС_ЯМ_Заказ.items КАК ИС_ЯМ_Заказ_items
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_ЯМ_СоответствиеХарактеристик КАК ИС_ЯМ_СоответствиеХарактеристик
	|		ПО ИС_ЯМ_Заказ_items.НоменклатураЯМ = ИС_ЯМ_СоответствиеХарактеристик.НоменклатураЯМ
	|			И ИС_ЯМ_Заказ_items.Ссылка.Профиль = ИС_ЯМ_СоответствиеХарактеристик.НоменклатураЯМ.Профиль
	|ГДЕ
	|	ИС_ЯМ_Заказ_items.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_СборочныеЗадания.Заказ КАК Ссылка
	|			ИЗ
	|				ВТ_СборочныеЗадания КАК ВТ_СборочныеЗадания)
	|
	|СГРУППИРОВАТЬ ПО
	|	ИС_ЯМ_Заказ_items.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИС_ЯМ_Заказ_items.Ссылка КАК СборочноеЗадание,
	|	ИС_ЯМ_СоответствиеХарактеристик.Номенклатура КАК Номенклатура,
	|	ИС_ЯМ_СоответствиеХарактеристик.Характеристика КАК Характеристика,
	|	СУММА(ИС_ЯМ_Заказ_items.count) КАК КоличествоЗаказ
	|ПОМЕСТИТЬ ВТ_Номенклатура
	|ИЗ
	|	Документ.ИС_ЯМ_Заказ.items КАК ИС_ЯМ_Заказ_items
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_ЯМ_СоответствиеХарактеристик КАК ИС_ЯМ_СоответствиеХарактеристик
	|		ПО ИС_ЯМ_Заказ_items.НоменклатураЯМ = ИС_ЯМ_СоответствиеХарактеристик.НоменклатураЯМ
	|			И ИС_ЯМ_Заказ_items.Ссылка.Профиль = ИС_ЯМ_СоответствиеХарактеристик.НоменклатураЯМ.Профиль
	|ГДЕ
	|	ИС_ЯМ_Заказ_items.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_Заказы.СборочноеЗадание КАК Ссылка
	|			ИЗ
	|				ВТ_Заказы КАК ВТ_Заказы
	|			ГДЕ
	|				&УсловиеНаКоличество)
	|
	|СГРУППИРОВАТЬ ПО
	|	ИС_ЯМ_Заказ_items.Ссылка,
	|	ИС_ЯМ_СоответствиеХарактеристик.Номенклатура,
	|	ИС_ЯМ_СоответствиеХарактеристик.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Номенклатура.СборочноеЗадание КАК Заказ,
	|	ВТ_Номенклатура.Номенклатура КАК Номенклатура,
	|	ВТ_Номенклатура.Характеристика КАК Характеристика,
	|	ВТ_Номенклатура.КоличествоЗаказ КАК КоличествоЗаказ,
	|	0 КАК КоличествоФакт,
	|	""Ложь"" КАК ЭтикеткаРаспечатана
	|ИЗ
	|	ВТ_Номенклатура КАК ВТ_Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	Заказ
	|ИТОГИ
	|	СУММА(КоличествоЗаказ)
	|ПО
	|	Заказ";
	
	Если Итератор = 0 Тогда
		УсловиеНаКоличество = " ВТ_Заказы.КоличествоЗаказ = 1";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеНаКоличество", УсловиеНаКоличество);
	Иначе
		УсловиеНаКоличество = " ВТ_Заказы.КоличествоЗаказ > 1";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеНаКоличество", УсловиеНаКоличество);
	КонецЕсли; 

	Запрос.УстановитьПараметр("Профиль", ЭтотОбъект.Профиль);
	Запрос.УстановитьПараметр("ДатаОт", НачалоДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("ДатаДо", КонецДня(ТекущаяДатаСеанса()));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Результат = РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		Возврат Результат;
	Иначе
		Возврат Ложь
	КонецЕсли;
	                                     
КонецФункции //- ИнфоСофт Янгиров Р.Р. 14.11.2024 УА #86762

//+ ИнфоСофт Янгиров Р.Р. 14.11.2024 УА #86762
&НаСервере
Функция ИзменитьСтатусыЗаказовЯМ()
	
	Запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ИС_ЯМ_СтатусыСборочныхЗаданий.Профиль КАК Профиль,
	|	ИС_ЯМ_СтатусыСборочныхЗаданий.Заказ КАК Заказ,
	|	ИС_ЯМ_СтатусыСборочныхЗаданий.status КАК status
	|ИЗ
	|	РегистрСведений.ИС_ЯМ_СтатусыСборочныхЗаданий КАК ИС_ЯМ_СтатусыСборочныхЗаданий
	|ГДЕ
	|	ИС_ЯМ_СтатусыСборочныхЗаданий.Заказ.shipmentDate МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ИС_ЯМ_СтатусыСборочныхЗаданий.status = &status
	|	И ИС_ЯМ_СтатусыСборочныхЗаданий.substatus = &substatus";
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("status",  Перечисления.ИС_ЯМ_СтатусыЗаказов.PROCESSING);
	Запрос.УстановитьПараметр("substatus", Перечисления.ИС_ЯМ_ДетальныеСтатусы.STARTED);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Результат = РезультатЗапроса.Выгрузить();
		Запись = РегистрыСведений.ИС_ЯМ_СтатусыСборочныхЗаданий.СоздатьМенеджерЗаписи();
		Для Каждого Стр из Результат Цикл
			Запись.Профиль= Стр.Профиль;
			Запись.Заказ = Стр.Заказ;
			Запись.Прочитать();
			
			Если Запись.Выбран() Тогда
				Запись.substatus = Перечисления.ИС_ЯМ_ДетальныеСтатусы.READY_TO_SHIP;
				Запись.Записать();
			КонецЕсли	
		КонецЦикла;
		//+ ИнфоСофт Власова И.С. 24.01.25 УА #91984
		Возврат Ложь;
		//- ИнфоСофт Власова И.С. 24.01.25 УА #91984
	Иначе
		Возврат Истина
	КонецЕсли;

КонецФункции //- ИнфоСофт Янгиров Р.Р. 14.11.2024 УА #86762

//+ ИнфоСофт Янгиров Р.Р. 14.11.2024 УА #86762
&НаСервере
Процедура СоздатьДокументыУпаковкиТоваровЯМ(ПараметрыОткрытия)
	
	Итератор = 0;
	
	Пока Итератор < 2 Цикл // два цикла так как один документ с кол-во 1 второй с кол-вом больше 2 
		
		РезультатЗапроса 						= ЗаполнитьДанныеЗаказаНаСервере(Итератор);
		
		Если РезультатЗапроса = Неопределено или РезультатЗапроса = Ложь Тогда
			Итератор = Итератор + 1;
			Текст = НСтр("ru='По заказам с количеством товара" + ?(Итератор < 2, " 1 ", " 2 и более ") + " документ не был создан.'");			
			ОбщегоНазначения.СообщитьПользователю(Текст);
			Продолжить;
		Иначе
			//+ ИнфоСофт Власова И.С. 24.01.25 УА #91984
			//ДокументУпаковки 					= Документы.ИС_Ozon_УпаковкаТоваров.СоздатьДокумент();
			ДокументУпаковки 					= Документы.ИС_ЯМ_УпаковкаТоваров.СоздатьДокумент();
			//- ИнфоСофт Власова И.С. 24.01.25 УА #91984
			ДокументУпаковки.Дата 				= ТекущаяДатаСеанса();
			ДокументУпаковки.Ответственный 		= Пользователи.ТекущийПользователь();
			ДокументУпаковки.Профиль            = ПараметрыОткрытия.Профиль;
			РезультатЗапроса 					= ПреобразоватьДеревоВТаблицуЗначений(РезультатЗапроса,ДокументУпаковки);
			
			ДокументУпаковки.Записать(РежимЗаписиДокумента.Запись);
			Текст = НСтр("ru='По заказам с количеством товара" + ?(Итератор < 2, " 1 ", " 2 и более ") + " был сознад документ упаковки товаров.'");			
			ОбщегоНазначения.СообщитьПользователю(Текст);
		КонецЕсли;		
		
		Итератор = Итератор + 1;
		
	КонецЦикла; 
	
КонецПроцедуры //- ИнфоСофт Янгиров Р.Р. 14.11.2024 УА #86762

#КонецОбласти
